import pandas as pd
import json

free_header1 = [
    "Номер требования-накладной",
    "Организация",
    "Структурное подраздение",
]

forms_header = [
    "Форма по ОКУД",
    "Форма по ОКПО",
    "БЕ"
]

table_header1 = [
    "Дата составления",
    "Код вида операции",
    "Отправитель. Структурное подраздение",
    "Отправитель. Табельный номер МОЛ (ЛОС)",
    "Получатель. Структурное подразделение",
    "Получатель. Табельный номер МОЛ (ЛОС)",
    "Корреспондирующий счет. Счет, субсчет",
    "Корреспондирующий счет. Код аналитического учета",
    "Учетная единица выпуска продукции (работ, услуг)",
]

free_header2 = [
    "Через кого",
    "Затребовал",
    "Разрешил",
]

table_header2 = [
    "Корреспондирующий счет",
    "Материальные ценности. наименование",
    "Материальные ценности. номенклатурный номер",
    "Характеристика",
    "Заводской номер",
    "Инвентарный номер",
    "Сетевой номер",
    "Единица изменения. Код",
    "Единица изменения. Наименование",
    "Количество. Затребовано",
    "Количество. Отпущено",
    "Цена",
    "Сумма без учета НДС",
    "Порядковый номер по складской картотеке",
    "Местонахождение",
    "Регистрационный номер партии товара, подлежащего прослеживаемости"
]

free_header3 = [
    "Отпустил. Должность",
    "Отпустил. Подпись",
    "Отпустил. Расшифровка",
    "Получил. Должность",
    "Получил. Подпись",
    "Получил. Расшифровка",
]

header_list = [
    *free_header1,
    *table_header1,
    *free_header2,
    *table_header2,
    *free_header3
]


def create_dataframes(json_path):
    with open(json_path, 'r', encoding='utf-8') as f:
        doc = json.load(f)

        df_forms = pd.DataFrame(columns=forms_header)

        df_forms.loc['Коды'] = [list(d.values())[0] for d in doc[0]['Таблицы'][0]][1:]

        df_table1 = pd.DataFrame(columns=table_header1)

        str_count_1 = len(doc[0]['Таблицы'][1])
        for i in range(2, str_count_1):
            df_table1.loc[i - 2] = doc[0]['Таблицы'][1][i].values()

        df_table2 = pd.DataFrame(columns=table_header2)

        str_count_2 = len(doc[0]['Таблицы'][2])
        for i in range(3, str_count_2):
            df_table2.loc[i - 3] = doc[0]['Таблицы'][2][i].values()

        return df_forms, df_table1, df_table2
